In [1]:
import pandas as pd

In [2]:
subm = pd.read_csv('../../output/submit_aqua.csv')

In [3]:
subm.head()

   id  price
0   0   2438
1   1   4354
2   2   4583
3   3   3715
4   4   4531

In [7]:
subm.rename(columns={'Price':'price'}, inplace = True)
subm.drop(columns=['Unnamed: 0'], axis = 1, inplace = True)
subm.price = subm.price.astype(int)

In [8]:
subm.head()

   id  price
0   0   4646
1   1   4042
2   2   4598
3   3   3394
4   4   3770

In [9]:
subm.to_csv('../../output/submission_aqua.csv', index=False)

In [10]:
wasd = pd.read_csv('../../output/submission_aqua.csv')

In [11]:
wasd.head()

   id  price
0   0   4646
1   1   4042
2   2   4598
3   3   3394
4   4   3770